Has the network latency gone up since we switched internet service providers?

There is no latency difference between internet service providers

There is a latency difference between internet service providers

Is the website redesign any good?


There is no difference between the old website design and the new design.

There is a difference between the old website design and the new design.

Is our television ad driving more sales?

There is no difference in sales with the television ad

There are more sales with the televsion ad.

In [8]:
import numpy as np
import pandas as pd

from pydataset import data
from scipy import stats

1- Use the following contingency table to help answer the question of whether using a macbook and being a codeup student are independent of each other.

In [2]:
# Create a dictionary representing the data
data = {
    "": ["Uses a Macbook", "Doesn't Use A Macbook"],
    "Codeup Student": [49, 1],
    "Not Codeup Student": [20, 30]
}

# Create a DataFrame from the dictionary
df = pd.DataFrame(data)

# Set the first column as the index
df.set_index("", inplace=True)

df

                       Codeup Student  Not Codeup Student

Uses a Macbook                     49                  20
Doesn't Use A Macbook               1                  30

In [3]:
chi2, p, dof, expected = stats.chi2_contingency(df)

In [4]:
chi2table = stats.chi2_contingency(df)

In [5]:
chi2table

Chi2ContingencyResult(statistic=36.65264142122487, pvalue=1.4116760526193828e-09, dof=1, expected_freq=array([[34.5, 34.5],
       [15.5, 15.5]]))

In [6]:
a = 0.05

print(f"Chi-square statistic: {chi2}")
print(f"P-value: {p:.20f}")
print(f"Degrees of freedom: {dof}")
print("Expected frequencies:")
print(pd.DataFrame(expected, index=df.index, columns=df.columns))

if p < a:
    print('We reject the null hypothesis. Using a MacBook and Being a Codeup student are dependent')
else:
    print('We fail to reject the null hypothesis. Using a MacBook and Being a Codeup student are independent')

Chi-square statistic: 36.65264142122487
P-value: 0.00000000141167605262
Degrees of freedom: 1
Expected frequencies:
                       Codeup Student  Not Codeup Student

Uses a Macbook                   34.5                34.5
Doesn't Use A Macbook            15.5                15.5
We reject the null hypothesis. Using a MacBook and Being a Codeup student are dependent

Choose another 2 categorical variables from the mpg dataset.

State your null and alternative hypotheses.

State your alpha.

Perform a chi2 test of indepedence.

State your conclusion

H0 null hypothesis: mpg is independent on cylinders

Ha Alternative hyppthesis: mpg is dependent on cylinders

In [9]:
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [10]:
mpg['cyl_cat'] = mpg['cyl'].map({
    4: '4-cylinder',
    5: '5-cylinder',
    6: '6-cylinder',
    8: '8-cylinder'
})

In [11]:

mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,cyl_cat
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,4-cylinder
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,4-cylinder
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,4-cylinder
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,4-cylinder
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,6-cylinder

In [12]:
mpg['mean_mpg'] = (mpg.cty + mpg.hwy) / 2
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,cyl_cat,mean_mpg
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,4-cylinder,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,4-cylinder,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,4-cylinder,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,4-cylinder,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,6-cylinder,21.0

In [13]:
mpg['mpg_cat'] = pd.qcut(mpg.mean_mpg, 2, labels = ['low_mpg', 'high_mpg'])
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,cyl_cat,mean_mpg,mpg_cat
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,4-cylinder,23.5,high_mpg
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,4-cylinder,25.0,high_mpg
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,4-cylinder,25.5,high_mpg
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,4-cylinder,25.5,high_mpg
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,6-cylinder,21.0,high_mpg

In [14]:
ct = pd.crosstab(mpg.cyl_cat, mpg.mpg_cat)
ct

mpg_cat     low_mpg  high_mpg
cyl_cat
4-cylinder        7        74
5-cylinder        0         4
6-cylinder       46        33
8-cylinder       68         2

In [15]:
chi, p, degf, exp = stats.chi2_contingency(ct)

In [16]:
a = 0.05

if p < a:
    print('We reject the null hypothesis. There appears to be a relationship.')
else:
    print('We fail to reject the null hypothesis.')

We reject the null hypothesis. There appears to be a relationship.

3. Use the data from the employees database to answer these questions:
    * Is an employee's gender independent of whether an employee works in sales or marketing? (only look at current employees)
    * Is an employee's gender independent of whether or not they are or have been a manager?

In [17]:
from env import get_connection
from sqlalchemy import text, create_engine

In [18]:
url  =get_connection('employees')

In [20]:
engine = create_engine(url)

In [21]:
query = '''
        SELECT *  

        FROM employees  

        INNER JOIN (
                    SELECT emp_no, dept_no, to_date
                    FROM dept_emp
                    WHERE to_date > curdate()
                    ) AS deps
                    ON employees.emp_no = deps.emp_no
        LEFT JOIN departments ON deps.dept_no = departments.dept_no;'''

In [22]:
text_query = text(query)

In [23]:
emps_df = pd.read_sql(text_query, engine.connect())
emps_df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no,dept_no,to_date,dept_no,dept_name
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,10001,d005,9999-01-01,d005,Development
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,10002,d007,9999-01-01,d007,Sales
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,10003,d004,9999-01-01,d004,Production
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,10004,d004,9999-01-01,d004,Production
4,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,10005,d003,9999-01-01,d003,Human Resources

In [25]:
dept_emps_df =  emps_df[emps_df['dept_name'].isin(['Sales', 'Marketing'])]

In [26]:
gender_dept_ct = pd.crosstab(dept_emps_df.gender, dept_emps_df.dept_name)
gender_dept_ct

dept_name  Marketing  Sales
gender
F               5864  14999
M               8978  22702

In [27]:
chi, p, degf, exp = stats.chi2_contingency(gender_dept_ct)

In [28]:
a = 0.05

if p < a:
    print('We reject the null hypothesis. There appears to be a relationship.')
else:
    print('We fail to reject the null hypothesis.')

We fail to reject the null hypothesis.

Is an employee's gender independent of whether or not they are or have been a manager?

In [29]:
mang_emps_df =  emps_df[emps_df['dept_name'].isin(['Sales', 'Marketing'])]

In [30]:
gender_mang_ct = pd.crosstab(mang_emps_df.gender, mang_emps_df.dept_name)
gender_mang_ct

dept_name  Marketing  Sales
gender
F               5864  14999
M               8978  22702

In [31]:
chi, p, degf, exp = stats.chi2_contingency(gender_dept_ct)

In [32]:
a = 0.05

if p < a:
    print('We reject the null hypothesis. There appears to be a relationship.')
else:
    print('We fail to reject the null hypothesis.')

We fail to reject the null hypothesis.

<div class="alert alert-block alert-info">
1. Answer with the type of stats test you would use (assume normal distribution):

* Is there a relationship between the length of your arm and the length of your foot?

Pearson's correlation coefficient.

Measure the strength and direction of a linear relationship between two continuous variables.

H
0
: There is no linear correlation between the length of your arm and the length of your foot.

H
a
: There is a linear relationship between the tlength of your arm and the length of your foot.

* Does smoking affect when or not someone has lung cancer?

Chi-squared test

Association between two categorical variables.

H
0
: There is no linear correlation between smoking and lung cancer.

H
a
: There is a linear relationship between smoking and lung cancer.

* Is gender independent of a person’s blood type?

Chi-squared test

Association between two categorical variables.

H
0
: There is no linear correlation between gender and the persons blood type.

H
a
: There is a linear relationship between gender and the persons blood type.

* Does whether or not a person has a cat or dog affect whether they live in an apartment?

Chi-squared test

Association between two categorical variables.

H
0
: There is no linear correlation between a persons pet type (cat or dog) and dwelling type.

H
a
: There is a linear relationship between a persons pet type (cat or dog) and dwelling type.

* Does the length of time of the lecture correlate with a student's grade?

Pearson's correlation coefficient.

Measure the strength and direction of a linear relationship between two continuous variables.

H
0
: There is no linear correlation between the student's grade and the length of the lecture.

H
a
: There is a linear relationship between the student's grade and the length of the lecture.

<div class="alert alert-block alert-info">
2. Use the telco_churn data.

In [33]:
url  =get_connection('telco_churn')

In [34]:
engine = create_engine(url)

In [35]:
query = '''
        SELECT * 
        FROM customers;'''

In [36]:
text_query = text(query)

In [37]:
telco_df = pd.read_sql(text_query, engine.connect())
telco_df.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,device_protection,tech_support,streaming_tv,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,1,No,...,No,Yes,Yes,No,2,Yes,2,65.6,593.3,No
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,1,No,...,No,No,No,Yes,1,No,2,59.9,542.4,No
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,2,No,...,Yes,No,No,No,1,Yes,1,73.9,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,2,No,...,Yes,No,Yes,Yes,1,Yes,1,98.0,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,2,No,...,No,Yes,Yes,No,1,Yes,2,83.9,267.4,Yes

In [38]:
telco_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               7043 non-null   object
 1   gender                    7043 non-null   object
 2   senior_citizen            7043 non-null   int64
 3   partner                   7043 non-null   object
 4   dependents                7043 non-null   object
 5   tenure                    7043 non-null   int64
 6   phone_service             7043 non-null   object
 7   multiple_lines            7043 non-null   object
 8   internet_service_type_id  7043 non-null   int64
 9   online_security           7043 non-null   object
 10  online_backup             7043 non-null   object
 11  device_protection         7043 non-null   object
 12  tech_support              7043 non-null   object
 13  streaming_tv              7043 non-null   object
 14  streaming_movies          7043 non-null   object
 15  contract_type_id          7043 non-null   int64
 16  paperless_billing         7043 non-null   object
 17  payment_type_id           7043 non-null   int64
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   object
 20  churn                     7043 non-null   object
dtypes: float64(1), int64(5), object(15)
memory usage: 1.1+ MB

In [39]:
# Convert the 'total_charges' column to float
telco_df['total_charges'] = pd.to_numeric(telco_df['total_charges'], errors='coerce')
telco_df['total_charges'] = telco_df['total_charges'].astype(float)

# Now the 'total_charges' column contains float values
telco_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               7043 non-null   object
 1   gender                    7043 non-null   object
 2   senior_citizen            7043 non-null   int64
 3   partner                   7043 non-null   object
 4   dependents                7043 non-null   object
 5   tenure                    7043 non-null   int64
 6   phone_service             7043 non-null   object
 7   multiple_lines            7043 non-null   object
 8   internet_service_type_id  7043 non-null   int64
 9   online_security           7043 non-null   object
 10  online_backup             7043 non-null   object
 11  device_protection         7043 non-null   object
 12  tech_support              7043 non-null   object
 13  streaming_tv              7043 non-null   object
 14  streaming_movies          7043 non-null   object
 15  contract_type_id          7043 non-null   int64
 16  paperless_billing         7043 non-null   object
 17  payment_type_id           7043 non-null   int64
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7032 non-null   float64
 20  churn                     7043 non-null   object
dtypes: float64(2), int64(5), object(14)
memory usage: 1.1+ MB

telco_df['total_charges'] = telco_df['total_charges'].fillna(0.0)
telco_df.info()

In [40]:
telco_df.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,device_protection,tech_support,streaming_tv,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,1,No,...,No,Yes,Yes,No,2,Yes,2,65.6,593.30,No
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,1,No,...,No,No,No,Yes,1,No,2,59.9,542.40,No
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,2,No,...,Yes,No,No,No,1,Yes,1,73.9,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,2,No,...,Yes,No,Yes,Yes,1,Yes,1,98.0,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,2,No,...,No,Yes,Yes,No,1,Yes,2,83.9,267.40,Yes

* Does tenure correlate with monthly charges?

    there is a correleation but it is weak 0.25 r

In [41]:
r, p = stats.pearsonr(telco_df.tenure, telco_df.monthly_charges)
r, p

(0.24789985628615005, 4.09404499149396e-99)

In [42]:
#Function to evaluate p values
def eval_result(p_value, a = 0.05):
    
    if p_value < a:
        
        print('Cool beans! Your result is significant!')
        
    else:
        
        print('Your result was not significant!')

In [43]:
eval_result(p)

Cool beans! Your result is significant!

* Total charges?

In [44]:
telco_df['total_charges'] = telco_df['total_charges'].fillna(0.0)

In [45]:
telco_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               7043 non-null   object
 1   gender                    7043 non-null   object
 2   senior_citizen            7043 non-null   int64
 3   partner                   7043 non-null   object
 4   dependents                7043 non-null   object
 5   tenure                    7043 non-null   int64
 6   phone_service             7043 non-null   object
 7   multiple_lines            7043 non-null   object
 8   internet_service_type_id  7043 non-null   int64
 9   online_security           7043 non-null   object
 10  online_backup             7043 non-null   object
 11  device_protection         7043 non-null   object
 12  tech_support              7043 non-null   object
 13  streaming_tv              7043 non-null   object
 14  streaming_movies          7043 non-null   object
 15  contract_type_id          7043 non-null   int64
 16  paperless_billing         7043 non-null   object
 17  payment_type_id           7043 non-null   int64
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   float64
 20  churn                     7043 non-null   object
dtypes: float64(2), int64(5), object(14)
memory usage: 1.1+ MB

In [46]:
r_tc, p_tc = stats.pearsonr(telco_df.tenure, telco_df.total_charges)
r_tc, p_tc

(0.8261783979502422, 0.0)

In [47]:
eval_result(p_tc)

Cool beans! Your result is significant!

* What happens if you control for phone and internet service?

In [48]:
telco_filtered = telco_df[(telco_df['phone_service'] == 'Yes') & (telco_df['internet_service_type_id'] == 1)]
telco_filtered.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,device_protection,tech_support,streaming_tv,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,1,No,...,No,Yes,Yes,No,2,Yes,2,65.60,593.30,No
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,1,No,...,No,No,No,Yes,1,No,2,59.90,542.40,No
5,0013-MHZWF,Female,0,No,Yes,9,Yes,No,1,No,...,No,Yes,Yes,Yes,1,Yes,4,69.40,571.45,No
8,0015-UOCOJ,Female,1,No,No,7,Yes,No,1,Yes,...,No,No,No,No,1,Yes,1,48.20,340.35,No
9,0016-QLJIS,Female,0,Yes,Yes,65,Yes,Yes,1,Yes,...,Yes,Yes,Yes,Yes,3,Yes,2,90.45,5957.90,No

In [49]:
r_filtered, p_filtered = stats.pearsonr(telco_filtered.tenure, telco_filtered.total_charges)
r_filtered, p_filtered

(0.9705931617494685, 0.0)

In [107]:
eval_result(p_filtered)

SyntaxError: unterminated string literal (detected at line 1) (1007142277.py, line 1)

<div class="alert alert-block alert-success">

Use the employees database.

* Is there a relationship between how long an employee has been with the company and the number of titles they have had?

In [51]:
url  =get_connection('employees')

In [52]:
engine = create_engine(url)

In [97]:
query = '''
SELECT *  
FROM employees.employees
LEFT JOIN (
			SELECT *
            FROM salaries
            WHERE to_date > curdate()
            ) AS sals 
            ON employees.emp_no = sals.emp_no
INNER JOIN (
			SELECT emp_no AS dep_emp_no, dept_no, to_date AS dep_to_date
			FROM dept_emp
			WHERE to_date > curdate()
			) AS deps
			ON employees.emp_no = deps.dep_emp_no
LEFT JOIN departments ON deps.dept_no = departments.dept_no;'''

In [98]:
text_query = text(query)

In [99]:
emp_df = pd.read_sql(text_query, engine.connect())
emp_df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,emp_no,salary,from_date,to_date,dep_emp_no,dept_no,dep_to_date,dept_no,dept_name
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,10001,88958,2002-06-22,9999-01-01,10001,d005,9999-01-01,d005,Development
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,10002,72527,2001-08-02,9999-01-01,10002,d007,9999-01-01,d007,Sales
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,10003,43311,2001-12-01,9999-01-01,10003,d004,9999-01-01,d004,Production
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,10004,74057,2001-11-27,9999-01-01,10004,d004,9999-01-01,d004,Production
4,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,10005,94692,2001-09-09,9999-01-01,10005,d003,9999-01-01,d003,Human Resources

In [104]:
emp_df['from_date'] = pd.to_datetime(emp_df['from_date'])
emp_df['to_date'] = pd.to_datetime(emp_df['to_date'])

OutOfBoundsDatetime: Out of bounds nanosecond timestamp: 9999-01-01 00:00:00, at position 0

* Is there a relationship between how long an employee has been with the company and their salary?

In [103]:
emp_df.to_date.head(1) + 1

TypeError: unsupported operand type(s) for +: 'datetime.date' and 'int'

Use the sleepstudy data.
* Is there a relationship between days and reaction time?

<div class=warn>
**Warning:** remember to do bookeping  
</div>

In [112]:
from IPython.core.display import HTML
def css_styling():
    styles = open("./styles/custom.css", "r").read()
    return HTML(styles)
css_styling()